[
{"description": "<div class=\"listing-container\">\n    <div>We are a small team of highly skilled Python developers working on a scalable image processing platform that efficiently processes drone imagery to geo-reference, align, stitch, blend, ortho-rectify and reconstruct - creating tens of thousands of point clouds, 3D models and mosaics a month. That data is used to drive high ROI decisions in industry as diverse as construction, agriculture, mining, conservation, forestry, and infrastructure inspection. We are looking for senior Python engineers that can join us. We are looking for Python developers who consider themselves experts and have experience shipping real products. We solve difficult problems here at DroneDeploy using Python, and we will pay very competitively for great engineers. This is for a longer term position. Learn more about us at <a href=\"http://www.dronedeploy.com/\">http://www.dronedeploy.com</a></div><div class=\"paragraph_break\"><br></div><div><strong>Your Experience</strong></div><ul><li>At least three years of experience developing in Python. </li><li>Can explain best practices, implement things like decorators, generators and multi-threading.</li><li>Experience with automated testing suites.</li><li>Experience with algorithms and complexity</li><li>Experience with systems and process management including resource allocation and networking</li><li>Experience with technologies like Mongo, Redis and S3</li><li>Experience building and managing APIs especially RESTful</li><li>Exposure to container technologies like Docker</li><li>Experience with image processing and GIS is a bonus but not required</li><li>Available to work your first few weeks onsite for on-boarding</li></ul><div class=\"paragraph_break\"><br></div><div><strong>Why You Should Choose Team DroneDeploy?</strong><br></div><div>DroneDeploy is the leading cloud software platform for commercial drones, making the power of aerial data accessible and productive for everyone. Trusted by businesses and individuals in over 130 countries worldwide, we are transforming the way drone users collect, manage and digest impactful data in a variety of industries, including agriculture, real estate, mining and construction. Simple by design and easy to use, DroneDeploy builds revolutionary software compatible with any drone. If you’re excited about drones and want to help us create a simple and seamless experience for drone users across the world, we’d love to hear from you!</div><div class=\"paragraph_break\"><br></div><div><strong>Include Responses to these questions in your application:</strong><br></div><div>1. How do you typically manage your Python dependencies and versions for a Python project?</div><div>2. What was your favorite project you've worked on and what did you like about it?</div><div>3. How would you test a piece of code that required access to a remote database through a network connection?</div><div>4. What resources (blogs, books and people) do you look to in order to improve as a Python engineer?</div>\n\n    \n  </div>", "location": "Headquarters: San Francisco, CA USA", "company": "DroneDeploy", "title": "Senior Python/Platform Engineer", "url": "https://weworkremotely.com/jobs/3351-senior-python-platform-engineer"},
{"description": "<div class=\"listing-container\">\n    <div>Follow Up Boss is a cutting edge CRM for small businesses. Customers love our product, check <a href=\"https://www.facebook.com/groups/agentsupport/permalink/760296570695278/\">what people say about us</a>. You'll be solving real problems for our thousands of daily users that run their businesses on FUB. We're bootstrapped, profitable and growing.</div><div class=\"paragraph_break\"><br></div><div>Looking for an experienced full stack engineer to join our small friendly team. You will be working on the new version of Follow Up Boss in React.js while extending <a href=\"https://api.followupboss.com/api-documentation/\">our REST API</a> to support new features and improvements. On the backend we use PHP, Postgres, MySQL, Redis, <a href=\"https://www.algolia.com/\">Algolia</a>. Everything is hosted on AWS.</div><div class=\"paragraph_break\"><br></div><div>We practice simplified version of Scrum with 1-week sprints for faster development and feedback, chat in Slack daily and meet in person on regular company retreats. Our roadmap is packed with new features and improvements based on solid feedback from customers.</div><div class=\"paragraph_break\"><br></div><div>This is a full-time job, choose to work remote or in our San Francisco office.</div><div class=\"paragraph_break\"><br></div><div><strong>What We Expect</strong></div><div class=\"paragraph_break\"><br></div><div>- Experience working in a fast-growing startup building and shipping a SaaS product.</div><div class=\"paragraph_break\"><br></div><div>- Great programming skills, ability to produce quality code that is maintainable, efficient, reliable and secure.</div><div class=\"paragraph_break\"><br></div><div>- Excellent knowledge of PHP and MySQL, ability to write complex queries that run fast.</div><div class=\"paragraph_break\"><br></div><div>- Good knowledge of JavaScript; experience with React.js is appreciated but not required.</div><div class=\"paragraph_break\"><br></div><div>- Linux administration skills, ability to set up and maintain production and dev servers.</div><div class=\"paragraph_break\"><br></div><div>- Fluent English and good communication skills.</div><div class=\"paragraph_break\"><br></div><div><strong>What You Can Expect</strong></div><div class=\"paragraph_break\"><br></div><div>- Solve challenging technical problems and put your skills to the test every day. See direct impact of your work and value you created for customers.</div><div class=\"paragraph_break\"><br></div><div>- Work in a small friendly team side-by-side with co-founders. Opportunity to learn all aspects of running a SaaS business.</div><div class=\"paragraph_break\"><br></div><div>- Provide direct input on technical (and not so technical) decisions, be heavily involved in the product design process. Your opinion matters, your ideas will be heard and appreciated.</div><div class=\"paragraph_break\"><br></div><div>- Flexible work schedule, work when you are the most productive and be with your family when they need you.</div><div class=\"paragraph_break\"><br></div><div>- Ability to work 100% remote, enjoy working from the comfort of your own home. We’re hiring the best people regardless of where they live.</div><div class=\"paragraph_break\"><br></div><div>- Loose vacation policy, take time off when you need it.</div><div class=\"paragraph_break\"><br></div><div>- Competitive compensation, year-end bonuses based on performance, trips to tech conferences and company meetups.</div><div class=\"paragraph_break\"><br></div><div>- Your choice of equipment, latest MacBook Pro or anything else you need.</div><div class=\"paragraph_break\"><br></div><div>- Monthly perks like Starbucks, WholeFoods, Uber, Movie Tickets, Dashlocker.</div><div class=\"paragraph_break\"><br></div><div>- Something else you need? Let us know.</div><div class=\"paragraph_break\"><br></div>\n\n    \n  </div>", "location": "Headquarters: San Francisco, CA", "company": "Follow Up Boss", "title": "Senior Full Stack Engineer", "url": "https://weworkremotely.com/jobs/3363-senior-full-stack-engineer"}
]